tap "anhoder/go-musicfox"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "tw93/tap"
brew "bash"
brew "bat"
brew "btop"
brew "freetype"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "dua-cli"
brew "git"
brew "git-delta"
brew "go"
brew "handbrake"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node"
brew "openjdk"
brew "pnpm"
brew "ripgrep"
brew "rustup"
brew "smartmontools"
brew "starship"
brew "tmux"
brew "uv"
brew "yazi"
brew "zoxide"
brew "anhoder/go-musicfox/go-musicfox"
brew "felixkratz/formulae/borders"
brew "tw93/tap/mole"
cask "nikitabobko/tap/aerospace"
cask "cursor"
cask "easydict"
cask "flowvision"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sarasa-gothic"
cask "ghostty"
cask "google-chrome"
cask "homerow"
cask "iina"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keka"
cask "loop"
cask "microsoft-edge"
cask "miniforge"
cask "navicat-premium-lite"
cask "neovide-app"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "sf-symbols"
cask "trae-cn"
cask "visual-studio-code"
cask "wetype"
cask "zed"
cask "keyclu"
vscode "be5invis.vscode-custom-css"
vscode "brandonkirbyson.vscode-animations"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "formulahendry.code-runner"
vscode "mechatroner.rainbow-csv"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "zhuangtongfa.material-theme"
cargo "cargo-cache"
cargo "cargo-update"
